## 02. 데이터프레임

데이터프레임이란?: 길이가 같은 벡터들을 열 원소로 갖는 2차원 객체

이 가이드의 실습을 위해서는 dplyr, readxl, writexl패키지 설치 및 불러오기가 필요합니다.r

In [2]:
library(dplyr)
library(readxl)
library(writexl)

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [3]:
df1<-read.csv("./데이터/03-df01.csv")        #csv파일 불러오기
df2<-read_excel("./데이터/03-df02.xlsx")     #xlsx파일 불러오기
df3<-read.csv("./데이터/03-df03.csv")
df4<-read.csv("./데이터/03-df04.csv")

In [7]:
df1;df2;df3;df4

  NAME     AGE SMOKE
1 Kim      56   TRUE
2 James    34  FALSE
3 Yamamoto 12  FALSE

  NAME      AGE SMOKE
1 Katherine 78   TRUE
2 Nicolas   45  FALSE

  SEX NATIONALITY
1 M   Korea
2 F   United Kingdom
3 M   Japan
4 F   United States
5 M   France

  CITY     NAME
1 New York Katherine
2 Seoul    Kim
3 London   James
4 Moscow   Zakhaev

In [8]:
df5<-rbind(df1, df2)
df6<-cbind(df5, df3)

In [9]:
df5
df6

  NAME      AGE SMOKE
1 Kim       56   TRUE
2 James     34  FALSE
3 Yamamoto  12  FALSE
4 Katherine 78   TRUE
5 Nicolas   45  FALSE

  NAME      AGE SMOKE SEX NATIONALITY
1 Kim       56   TRUE M   Korea
2 James     34  FALSE F   United Kingdom
3 Yamamoto  12  FALSE M   Japan
4 Katherine 78   TRUE F   United States
5 Nicolas   45  FALSE M   France

In [35]:
merge(df6, df4, all=TRUE)
merge(df6, df4, all=FALSE)
merge(df6, df4, all.x=TRUE)
merge(df6, df4, all.y=TRUE)

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul
4 Nicolas   45  FALSE M   France         NA
5 Yamamoto  12  FALSE M   Japan          NA
6 Zakhaev   NA     NA NA  NA             Moscow

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul
4 Nicolas   45  FALSE M   France         NA
5 Yamamoto  12  FALSE M   Japan          NA

  NAME      AGE SMOKE SEX NATIONALITY    CITY
1 James     34  FALSE F   United Kingdom London
2 Katherine 78   TRUE F   United States  New York
3 Kim       56   TRUE M   Korea          Seoul
4 Zakhaev   NA     NA NA  NA             Moscow

In [46]:
df10<-read.csv("./데이터/03-고령인구비율.csv", fileEncoding='euc-kr')

In [48]:
head(df10)

  도     시군   고령인구비율2010 고령인구비율2015 고령인구비율2020
1 강원도 춘천시 13.1             14.8             17.9
2 강원도 원주시 11.1             12.3             15.1
3 강원도 강릉시 14.3             17.2             21.3
4 강원도 동해시 13.2             15.9             20.2
5 강원도 태백시 14.8             19.0             25.2
6 강원도 속초시 12.7             15.2             19.2

In [49]:
max(df10$고령인구비율2010)
min(df10$고령인구비율2010)
sum(df10$고령인구비율2010)
median(df10$고령인구비율2010)
mean(df10$고령인구비율2010)
quantile(df10$고령인구비율2010)
summary(df10$고령인구비율2010)

[1] 32

[1] 9.4

[1] 1153.7

[1] 20.9

[1] 20.97636

   0%   25%   50%   75%  100%
 9.40 16.15 20.90 26.70 32.00

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
   9.40   16.15   20.90   20.98   26.70   32.00

In [52]:
slice(df10, c(1,3,5,7))                   #행을 번호로 선택
slice_max(df10, df10$고령인구비율2010, prop=0.1)

  도     시군   고령인구비율2010 고령인구비율2015 고령인구비율2020
1 강원도 춘천시 13.1             14.8             17.9
2 강원도 강릉시 14.3             17.2             21.3
3 강원도 태백시 14.8             19.0             25.2
4 강원도 삼척시 17.9             20.5             25.4

  도       시군   고령인구비율2010 고령인구비율2015 고령인구비율2020
1 전라남도 고흥군 32.0             36.6             41.1
2 전라남도 보성군 29.5             33.5             38.5
3 전라남도 함평군 29.5             32.3             36.6
4 전라남도 곡성군 29.1             32.2             36.3
5 전라북도 임실군 28.9             31.5             36.4

In [59]:
df10 %>% group_by(도) %>% summarise('도별 고령인구비율 평균' = mean(고령인구비율2010))

  도       도별 고령인구비율 평균
1 강원도   17.08333
2 전라남도 23.43043
3 전라북도 21.95000